app/controllers/users_controller.rb

  def update
    if @user == current_user && role_param.present? && role_param != "owner"
      @user.errors.add(:role, I18n.t("backend.users.cannot_remove_owner"))
      render :edit, status: :unprocessable_content
    elsif update_user
      audit_security_event("user_updated", target_user_id: @user.id, role: @user.role)
      redirect_to users_path, notice: I18n.t("backend.users.updated")
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "burak"], ["last_name", "Duvaklı"], ["updated_at", "2026-08-07 18:30:32.980986"], ["id", "41e5f88a-c9ed-4f2c-8eaa-145ef714c79e"]]