app/models/user.rb

  def onboarded?
    onboarded_at.present? || financial_accounts.exists? || finance_categories.exists? || finance_transactions.exists?
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]